int/resources/objectRepo/xmlTemplates/opera/MembershipConfig/req_CreateMembershipLevels.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/mdm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CreateMembershipLevelsRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:MembershipLevels>
            <v91:MembershipLevel>
               <v91:Type/>
               <v91:Code/>
               <v91:Description/>
               <v91:Label/>
               <v91:Rank/>
               <v91:VIP/>
               <v91:DisplayColor/>
               <v91:Inactive/>
               <v91:FolioTexts>
                  <v91:HotelFolioTexts HotelCode="?">
                     <v91:FolioText1/>
                     <v91:FolioText2/>
                     <v91:FolioText3/>
                     <v91:FolioText4/>
                  </v91:HotelFolioTexts>
               </v91:FolioTexts>
               <v91:Fulfillment/>
               <v91:ChangesRestricted/>
               <v91:AutoRenewGrace/>
               <v91:CardValidYears/>
               <v91:RestrictedLevel/>
               <v91:RenewCard/>
               <v91:FeeRequired/>
               <v91:MaxDowngradeLevel/>
               <v91:NumberOfTransactions/>
            </v91:MembershipLevel>
         <v91:MembershipLevel>
               <v91:Type/>
               <v91:Code/>
               <v91:Description/>
               <v91:Label/>
               <v91:Rank/>
               <v91:VIP/>
               <v91:DisplayColor/>
               <v91:Inactive/>
               <v91:FolioTexts>
                  <v91:HotelFolioTexts HotelCode="?">
                     <v91:FolioText1/>
                     <v91:FolioText2/>
                     <v91:FolioText3/>
                     <v91:FolioText4/>
                  </v91:HotelFolioTexts>
               </v91:FolioTexts>
               <v91:Fulfillment/>
               <v91:ChangesRestricted/>
               <v91:AutoRenewGrace/>
               <v91:CardValidYears/>
               <v91:RestrictedLevel/>
               <v91:RenewCard/>
               <v91:FeeRequired/>
               <v91:MaxDowngradeLevel/>
               <v91:NumberOfTransactions/>
            </v91:MembershipLevel></v9:MembershipLevels>
      </v9:CreateMembershipLevelsRQ>
   </soapenv:Body>
</soapenv:Envelope>